{"format": "layers-model", "generatedBy": "keras v3.6.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.6.0", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 140344234063376}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 6], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}}, "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 6]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 140344234063376}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 16]}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 140344234063376}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 16]}}], "build_input_shape": [null, 6]}, "build_config": {"input_shape": [null, 6]}, "compile_config": {"optimizer": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "layers/batch_normalization/vars/0", "shape": [16], "dtype": "float32"}, {"name": "layers/batch_normalization/vars/1", "shape": [16], "dtype": "float32"}, {"name": "layers/batch_normalization/vars/2", "shape": [16], "dtype": "float32"}, {"name": "layers/batch_normalization/vars/3", "shape": [16], "dtype": "float32"}, {"name": "layers/dense/vars/0", "shape": [6, 16], "dtype": "float32"}, {"name": "layers/dense/vars/1", "shape": [16], "dtype": "float32"}, {"name": "layers/dense_1/vars/0", "shape": [16, 1], "dtype": "float32"}, {"name": "layers/dense_1/vars/1", "shape": [1], "dtype": "float32"}, {"name": "optimizer/vars/0", "shape": [], "dtype": "int32"}, {"name": "optimizer/vars/1", "shape": [], "dtype": "float32"}, {"name": "optimizer/vars/10", "shape": [16, 1], "dtype": "float32"}, {"name": "optimizer/vars/11", "shape": [16, 1], "dtype": "float32"}, {"name": "optimizer/vars/12", "shape": [1], "dtype": "float32"}, {"name": "optimizer/vars/13", "shape": [1], "dtype": "float32"}, {"name": "optimizer/vars/2", "shape": [6, 16], "dtype": "float32"}, {"name": "optimizer/vars/3", "shape": [6, 16], "dtype": "float32"}, {"name": "optimizer/vars/4", "shape": [16], "dtype": "float32"}, {"name": "optimizer/vars/5", "shape": [16], "dtype": "float32"}, {"name": "optimizer/vars/6", "shape": [16], "dtype": "float32"}, {"name": "optimizer/vars/7", "shape": [16], "dtype": "float32"}, {"name": "optimizer/vars/8", "shape": [16], "dtype": "float32"}, {"name": "optimizer/vars/9", "shape": [16], "dtype": "float32"}]}]}